bolitecenv/dspic33ck_bldc_dev_board.X/mcp8024_driver.h
/* Microchip Technology Inc. and its subsidiaries.  You may use this software 
 * and any derivatives exclusively with Microchip products. 
 * 
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER 
 * EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A 
 * PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION 
 * WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION. 
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
 * INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
 * WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
 * BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE 
 * FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS 
 * IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF 
 * ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE 
 * TERMS. 
 */

/* 
 * File:   
 * Author: 
 * Comments:
 * Revision history: 
 */

// This is a guard condition so that contents of this file are not included
// more than once.  
#ifndef MCP8024_DRIVER_H
#define	MCP8024_DRIVER_H

#include <xc.h> // include processor files - each processor file is guarded.  

#define CE_ON   0x0001
#define CE_OFF  0x0000

// Macro function
#define MCP8024_CE(x)  (LATE = ((LATE) & ~(1 << 4)) | ((x) << 4)) 

#define MCP8024_isBusy() ~(PORTCbits.RC13)


typedef enum
{
    NormalOperation = 0,
    Unregistered,
    TempWarning,
    OverTemp,
    UnderVoltage,
    OverVoltage,
    BR_OverCurrent,
    BR_OutputUnderVoltageWarning,
    BR_OutputUnderVoltage
}ERROR_CODE;



void MCP8024_Send_CMD(uint8_t cmd);
error_t MCP8024_Receive(uint8_t *buf, uint8_t receive_buf_size, uint16_t time_out);
void MCP8024_Receive_IT(uint8_t *buf, uint8_t receive_buf_size);
void MCP8024_Receive_IT_Complete_Callback(void);
void MCP8024_Receive_Callback(void);
void MCP8024_Error_Handler(uint8_t cmd, uint8_t error_code);


#ifdef	__cplusplus
extern "C" {
#endif /* __cplusplus */

    // TODO If C++ is being used, regular C code needs function names to have C 
    // linkage so the functions can be used by the c code. 

#ifdef	__cplusplus
}
#endif /* __cplusplus */

#endif	/* XC_HEADER_TEMPLATE_H */

